{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hello",
          "Hey",
          "Hi there",
          "Hey there",
          "Greetings"
        ],
        "responses": [
          "Hello! How can I help you today?",
          "Hi! What can I help you with?",
          "Hey there! How can I assist you?"
        ],
        "context_set": ""
      },
      {
        "tag": "goodbye",
        "patterns": [
          "Bye",
          "See you later",
          "Goodbye",
          "Adios",
          "Ciao"
        ],
        "responses": [
          "Goodbye!",
          "See you later!",
          "Have a nice day!"
        ],
        "context_set": ""
      },
      {
        "tag": "thanks",
        "patterns": [
          "Thanks",
          "Thank you",
          "Appreciate it",
          "Thanks a lot",
          "Thanks so much"
        ],
        "responses": [
          "You're welcome!",
          "Anytime!",
          "Glad I could help!"
        ],
        "context_set": ""
      },
      {
        "tag": "navigation",
        "patterns": [
          "Where is [location]?",
          "How do I get to [location]?",
          "What is the best way to get to [location]?",
          "Can you give me directions to [location]?"
        ],
        "responses": [
          "Sure, [location] is located [directions].",
          "To get to [location], you need to [directions].",
          "You can find [location] [directions].",
          "Here's how to get to [location]: [directions]."
        ],
        "context_set": ""
      },
      {
        "tag": "services",
        "patterns": [
          "What services are available?",
          "What can I find on campus?",
          "What are the facilities available?",
          "What resources are available?"
        ],
        "responses": [
          "There are many services available, including [services].",
          "On campus, you can find [services] and much more.",
          "Some of the facilities available include [facilities].",
          "You can find a wide range of resources on campus, including [resources]."
        ],
        "context_set": ""
      },
      {
        "tag": "faculty",
        "patterns": [
          "Tell me about the Faculty of Science and Techniques",
          "What programs are available in the Faculty of Science and Techniques?",
          "Can you give me information about the Faculty of Science and Techniques?"
        ],
        "responses": [
          "The Faculty of Science and Techniques offers a wide range of programs, including [programs].",
          "The Faculty of Science and Techniques is dedicated to advancing knowledge in [areas of research].",
          "The Faculty of Science and Techniques is committed to providing students with a top-quality education in [areas of study]."
        ],
        "context_set": ""
      },
      {
        "tag": "research",
        "patterns": [
          "Tell me about research opportunities on campus",
          "What kind of research is being done on campus?",
          "Are there any research programs available?"
        ],
        "responses": [
          "There are many research opportunities available on campus, including [research opportunities].",
          "At our college, we are conducting cutting-edge research in [areas of research].",
          "There are several research programs available for you" 
        ],
        "context_set": ""
      },
        {
            "tag": "1",
            "patterns": ["What are the office hours for the advising center?", "When can I meet with an academic advisor?", "Where can I find academic advising?"],
            "responses": ["The advising center is open Monday-Friday from 8am-5pm. You can make an appointment online or visit us in person in the science building.", "Academic advising is available by appointment. You can schedule a meeting online or visit us in person during our office hours.", "The advising center is located on the third floor of the science building. Walk-ins are welcome, but appointments are recommended."]
        },
        {
            "tag": "2",
            "patterns": ["How do I register for classes?", "When is the registration deadline?", "What classes are required for my major?"],
            "responses": ["You can register for classes online through the student portal. The registration deadline for each semester is posted on our website.", "The registration deadline for the fall semester is August 15th. Check our website for the deadline for other semesters.", "You can find a list of required courses for your major on our website. You should also meet with your academic advisor to discuss your course plan."]
        },
        {
            "tag": "3",
            "patterns": ["What resources are available in the library?", "How do I check out a book?", "What are the library hours?"],
            "responses": ["The library has a wide selection of books, journals, and online resources. You can check out books at the front desk with your student ID.", "The library is open Monday-Friday from 8am-9pm and on weekends from 10am-6pm. You can find more information about our services on our website.", "The library also offers research assistance, computer workstations, and group study rooms. Visit us in person or online for more information."]
        },
        {
            "tag": "4",
            "patterns": ["How do I join a student organization?", "What clubs are available on campus?", "When do student organizations meet?"],
            "responses": ["You can browse a list of student organizations on our website and contact the club leaders to learn more. Many clubs have meetings during common hour, which is from 12pm-1pm on Wednesdays.", "We have a variety of student organizations on campus, including academic clubs, social clubs, and service organizations. Visit our website to see a full list and descriptions.", "Each student organization has its own meeting schedule. Check with the club leader or visit their website for more information."]
        },
        {
            "tag": "5",
            "patterns": ["What dining options are available on campus?", "Where is the nearest cafeteria?", "Can I use my meal plan at off-campus restaurants?"],
            "responses": ["We have several dining options on campus, including a cafeteria, coffee shop, and food truck. You can use your meal plan at any of these locations.", "The cafeteria is located on the first floor of the science building. It is open for breakfast, lunch, and dinner.", "Meal plans cannot be used at off-campus restaurants, but many local businesses offer student discounts. Check with individual businesses for details."]
        }
    ]
}
  